arribada/CLS-Argos-Linkit-CORE/ports/nrf52840/main.c
nrf_log_backend_cb_t nrf_log_backend_uart_cb = {
    .p_next = NULL,
    .id = NRF_LOG_BACKEND_INVALID_ID,
    .enabled = false,
};

const nrf_log_backend_t nrf_log_backend_uart = {
    .p_api = &nrf_log_backend_uart_api,  //!< Pointer to interface.
    .p_ctx = NULL,  //!< User context.
    .p_name = "CUSTOM_UART", //!< Name of the backend.
    .p_cb = &nrf_log_backend_uart_cb,   //!< Pointer to the backend control block.
};

void log_backend_init(void)
{
    nrf_log_init(NULL, LOG_TIMESTAMP_DEFAULT_FREQUENCY);
    int32_t backend_id = nrf_log_backend_add(&nrf_log_backend_uart, NRF_LOG_SEVERITY_DEBUG);
    ASSERT(backend_id >= 0);
    nrf_log_backend_enable(&nrf_log_backend_uart);
}

/**@brief Application main function.
 */
int main(void)
{
    // Initialize.
    nrfx_uarte_init(&uarte, &uarte_config, NULL);
    setvbuf(stdout, NULL, _IONBF, 0);

    printf("Device started\r\n");

    log_backend_init();
    printf("%s():%u\r\n", __FUNCTION__, __LINE__);

    NRF_LOG_INFO("Logging test");
    printf("%s():%u\r\n", __FUNCTION__, __LINE__);
    NRF_LOG_FLUSH();
    printf("%s():%u\r\n", __FUNCTION__, __LINE__);

    timers_init();
    printf("%s():%u\r\n", __FUNCTION__, __LINE__);
    power_management_init();
    printf("%s():%u\r\n", __FUNCTION__, __LINE__);
    ble_stack_init();
    printf("%s():%u\r\n", __FUNCTION__, __LINE__);
    gap_params_init();
    printf("%s():%u\r\n", __FUNCTION__, __LINE__);
    gatt_init();
    printf("%s():%u\r\n", __FUNCTION__, __LINE__);
    services_init();
    printf("%s():%u\r\n", __FUNCTION__, __LINE__);
    advertising_init();
    printf("%s():%u\r\n", __FUNCTION__, __LINE__);
    conn_params_init();
    printf("%s():%u\r\n", __FUNCTION__, __LINE__);

    // Start execution.
    printf("\r\nUART started.\r\n");
    NRF_LOG_INFO("Debug logging for UART over RTT started.");
    advertising_start();

    // Enter main loop.
    for (;;)
    {
        idle_state_handle();
    }
}

/*

#include "spi_flash_file_system.hpp"
#include "nrf_delay.h"
#include "nrf_gpio.h"
#include "bsp.hpp"

#define BLOCK_COUNT   (4096)
#define BLOCK_SIZE    (4*1024)
#define PAGE_SIZE     (256)

#define RED_LED_GPIO (NRF_GPIO_PIN_MAP(1, 7))

// Redirect std::cout and printf output to debug UART
// We have to define this as extern "C" as we are overriding a weak C function
extern "C" int _write(int file, char *ptr, int len)
{
	nrfx_uarte_tx(&BSP::UART_Inits[BSP::UART_1].uarte, reinterpret_cast<const uint8_t *>(ptr), len);
	return len;
}

int main() {

	nrfx_uarte_init(&BSP::UART_Inits[BSP::UART_1].uarte, &BSP::UART_Inits[BSP::UART_1].config, nullptr);

	printf("GenTracker Booted\r\n");

	auto filesystem = LFSSpiFlashFileSystem(BLOCK_COUNT, BLOCK_SIZE, PAGE_SIZE);
	filesystem.init();

	if (filesystem.mount())
	{
		filesystem.format();
		filesystem.mount();
	}	

	nrf_gpio_cfg_output(RED_LED_GPIO);
	nrf_gpio_pin_clear(RED_LED_GPIO);

	for(;;)
	{
		nrf_gpio_pin_toggle(RED_LED_GPIO);
		nrf_delay_ms(500);
	}

	return 0;
}

*/

/*
#include "scheduler.hpp"
#include "filesystem.hpp"
#include "gentracker.hpp"

#define BLOCK_COUNT   (256)
#define BLOCK_SIZE    (64*1024)
#define PAGE_SIZE     (256)


// Global contexts
FileSystem *main_filesystem;

// FSM initial state -> BootState
FSM_INITIAL_STATE(GenTracker, BootState)

using fsm_handle = GenTracker;

int main() {
	// Setup global contexts
	// TODO: this should be replaced with a new FlashFileSystem variant
	main_filesystem = new RamFileSystem(BLOCK_COUNT, BLOCK_SIZE, PAGE_SIZE);

	// This will initialise the FSM
	fsm_handle::start();

	// The scheduler should run forever.  Any run-time exceptions should be handled by the
	// lambda function which passes them into the FSM
	Scheduler::run([](int err) {
		ErrorEvent e;
		e.error_code = static_cast<enum ErrorCode>(err);
		fsm_handle::dispatch(e);
	});

	return 0;
}
*/